{"source":"http://ooquotes.com/a-list-of-most-used-39-memorable-mean-girls-quotes.html","results":["\n\tA list of most-used 39 memorable mean girls quotes\n\n\t\n\tAre you finding popular mean girls quotes? Enjoy the greatest quotes from this famous film. we collect best gifs from mean girls quotes; don't forget share them in everywhere if you like them.\n\n\tmean girls movie,Mean Girls is a 2004 American teen comedy film directed by Mark Waters.Director: Mark Waters,Stars: Lindsay Lohan, Jonathan Bennett, Rachel McAdams\n\n\t\n\n\tIt's not my fault you're like,in love with me,or something!\n\n\t \n\n\t\n\n\tYou may think you like someone, but you could be wrong.\n\n\t \n\n\t\n\n\tOn October 3rd, he asked me what day it was.\n\n\t \n\n\t\n\n\tMom, can you pick me up? I'm scared.\n\n\t \n\n\t\n\n\tAnd on the third day, God created the Remington bolt-action rifle so that Man could fight the dinosaurs…and the homosexuals.\n\n\t \n\n\t\n\n\tYour hair looks sexy pushed back.\n\n\t \n\n\t\n\n\tDon't have sex, 'cause you will get pregnant…and die.\n\n\t \n\n\t\n\n\tOh my God, Danny Devito! I love your work!\n\n\t \n\n\t\n\n\tWhatever, I'm getting cheese fires.\n\n\t \n\n\t\n\n\tJanis, I cannot stop this car, I have a curfew.\n\n\t \n\n\t\n\n\tThe limit does not exist.\n\n\t \n\n\t\n\n\tso fetch!\n\n\t \n\n\t\n\n\tAnd I'd be like, \"Why are you so obsessed with me?\"\n\n\t \n\n\t\n\n\tIn Girl WOrld,Halloween is the one night a year when girls can dress like a total slut and no other girls can say anything about it.\n\n\t \n\n\t\n\n\tI'm kind of psychic. I have a fifth sense.\n\n\t \n\n\t\n\n\tIt's Halloween!\n\n\t \n\n\t\n\n\tJanis: Did you have an awesome time? Did you drink awesome shooters, listen to awesome music, and then just sit around and soak up each others awesomeness?\n\n\t \n\n\t\n\n\tDamn, you are SO lucky you have us to guide you!\n\n\t \n\n\t\n\n\t-Nice wig,Janis. What's it made of?\n\t-Your Mom's chest hair!\n\n\t \n\n\t\n\n\tThere are two kinds of evil people in this world. Those who do evil stuff and those who see evil stuff being done and don't try to stop it\n\n\t \n\n\t\n\n\tI like you.\n\n\tGo away!\n\n\t \n\n\t\n\n\tShut up.\n\n\t \n\n\t\n\n\tHow many of you have ever felt personally victimized by Regina George?\n\n\t \n\n\t\n\n\tGet in, loser. We're going shopping.\n\n\t \n\n\t\n\n\tAnd right now you're getting on my last nerve.\n\n\t \n\n\t\n\n\tAnd none for Gretchen Wieners,bye.\n\n\t \n\n\t\n\n\tYou can't sit with us!\n\n\t \n\n\t\n\n\tYou know swedish?\n\n\t \n\n\t \n\n\t\n\n\tLove ya.\n\n\t \n\n\t \n\n\t\n\n\tBecause being with the plastics was like being famous.\n\n\t \n\n\t\n\n\tSo if you're from Africa, why are you white?\n\n\t \n\n\t\n\n\tStupid girls make up rumours because they're bored with their on lives.\n\n\t \n\n\t\n\n\tYou are a mean girl! YOu're a bitch!\n\n\t \n\n\t\n\n\tI don't wanna be punished for being well-liked.\n\n\t \n\n\t\n\n\tCalling somebody else fat won't make you any skinnier. Calling someone stupid doesn't make you any smarter.\n\n\t \n\n\t\n\n\tI just have a lot of feelings.\n\n\t \n\n\t\n\n\tI'm not like a regular mom. I'm a cool mom.\n\n\t \n\n\t\n\n\tHell,no. I did \"not\" leave the South Side for this!\n\n\t \n\n\t\n\n\tBut you all have got to stop calling each other sluts and whores. It just makes it okay for guys to call you sluts and whores.\n\n\n\n\nYour email address will not be published. Required fields are marked *    Save my name, email, and website in this browser for the next time I comment. \n\n"]}