{"source":"https://parade.com/1039651/marynliles/dr-seuss-quotes/","results":["Every March 2nd we celebrate the birthday of Theodor Geisel—you know him as Dr. Seuss. Dr. Seuss is known for his delightful rhymes and stories for kids. But beyond quotes from Dr. Seuss's famous children's books—from Oh, the Places You'll Go! to Green Eggs and Ham—the best Dr. Seuss quotes apply to adults and everyday life, too.The prolific children’s book author was born on March 2, 1904, and his mark on kids’ literature was so indelible, the National Education Association created National Read Across America Day in honor of the day. Dr. Seuss passed away in 1991 at age 87, but new generations of children still learn to read—and learn to flex their imaginations—with his unforgettable characters and rhymes to this day. That’s why we’re marking his life with some of Dr. Seuss' most inspiring quotes—many of which work well as birthday wishes! Some quotes are drawn from his books and others from interviews, but they’re all equally worth remembering.From the best famous Dr. Seuss quotations to Dr. Seuss quotes that encourage you to embrace your individuality to funny Doctor Seuss quotes and sayings that'll make you feel like a kid again, these best Dr. Seuss quotes about life are guaranteed to make your day just a little bit brighter.You'll be familiar with some of these famous Dr. Seuss quotations, while others may be entirely new to you. But one thing's for sure: This big list of the 101 best Dr. Seuss quotes and sayings has something just right for every occasion.1. “A person’s a person, no matter how small.” — Dr. Seuss2. “To the world you may be one person but to one person you may be the world.” — Dr. Seuss3. “Simple it’s not, I am afraid you will find, for a mind-maker-upper to make up his mind.” – Dr. Seuss4. “Things are never quite as scary when you’ve got a best friend.” – Dr. Seuss5. “You have brains in your head. You have feet in your shoes. You can steer yourself any direction you choose.” — Dr. Seuss6. “You do not like them. So you say. Try them! Try them! And you may!” – Dr. Seuss7. “If we do not choose, we will end up with none.” — Dr. Seuss8. “They say I’m old-fashioned, and live in the past, but sometimes I think progress progresses too fast!” – Dr. Seuss9. “I do not like green eggs and ham. I do not like them, Sam-I-Am.” ― Dr. Seuss10. “You’re off to great places! Today is your day! Your mountain is waiting, So get on your way!” — Dr. Seuss11. “Fill your house with stacks of books, in all the crannies and all the nooks.” ― Dr. Seuss12. “If you’d never been born, then you might be an Isn’t! An Isn’t has no fun at all. No, he didn’t!” – Dr. Seuss13. “Adults are just obsolete children and the hell with them.” ― Dr. Seuss14. “Today was good. Today was fun. Tomorrow is another one.” — Dr. Seuss15. “Don’t cry because it’s over, smile because it happened.” — Dr. SeussRelated: 20 Dr. Seuss Facts You Probably Didn't Know16. “Only you can control your future.” — Dr. Seuss17. “I have heard there are troubles of more than one kind. Some come from ahead and some come from behind. But I’ve bought a big bat. I’m all ready you see. Now my troubles are going to have troubles with me!” — Dr. Seuss18. “With your head full of brains and your shoes full of feet, you’re too smart to go down any not-so-good street.” – Dr. Seuss19. “You’re on your own. And you know what you know. And you are the one who’ll decide where to go.” — Dr. Seuss20. “You have to be odd to be number one.” — Dr. Seuss21. “One fish, two fish, red fish, blue fish!” ― Dr. Seuss22. “Think left and think right and think low and think high. Oh, the thinks you can think up if only you try!” — Dr. Seuss23. “It is better to know how to learn than to know.” — Dr. Seuss24. “We are all a little weird and life’s a little weird, and when we find someone whose weirdness is compatible with ours, we join up with them and fall in mutual weirdness and call it love.” — Dr. Seuss25. “You’re never too old, too wacky, too wild, to pick up a book and read to a child.” – Dr. Seuss26. “I’m glad we had the times together just to laugh and sing a song, seems like we just got started and then before you know it, the times we had together were gone.” ― Dr. Seuss27. “ASAP. Whatever that means. It must mean, 'Act swiftly awesome pacyderm!” ― Dr. Seuss28. “I like nonsense, it wakes up the brain cells.” – Dr. Seuss29. “I'm afraid that sometimes you'll play lonely games too. Games you can't win 'cause you'll play against you.” ― Dr. Seuss30. \"Be who you are and say what you feel because those who mind don’t matter and those who matter don’t mind.” — Dr. Seuss31. “What if Christmas, he thought, doesn't come from a store. What if Christmas...perhaps...means a little bit more!” — Dr. Seuss32. “You know when you’re in love when you can’t fall asleep because reality is finally better than your dreams.” — Dr. Seuss33. “Life is too short to wake up in the morning with regrets.” — Dr. Seuss34. “Fantasy is a necessary ingredient in living—it’s a way of looking at life through the wrong end of a telescope.” — Dr. Seuss35. “You’re in pretty good shape for the shape you are in.” — Dr. Seuss36. “Reading can take you places you have never been before.” — Dr. Seuss37. “When something bad happens you have three choices. You can either let it define you, let is destroy you, or you can let it strengthen you.”― Dr. Seuss38. “It’s opener there in the wide open air.” — Dr. Seuss39. “You’ll miss the best things if you keep your eyes shut.” — Dr. Seuss40. “If you never did you should. These things are fun and fun is good.” – Dr. Seuss41. “I meant what I said and I said what I meant.” — Dr. Seuss42. “Today you are you, that is truer than true. There is no one alive that is youer than you.” — Dr. Seuss43. “Remember me and smile, for it’s better to forget than to remember me and cry.” — Dr. Seuss44. “Kid, you’ll move mountains.” — Dr. Seuss45. “I don’t care how you go. Just get.” — Dr. Seuss46. “Always remember you are braver than you believe, stronger than you seem, smarter than you think and twice as beautiful as you’ve ever imagined.” — Dr. Seuss47. “For a host, above all, must be kind to his guests.” ― Dr. Seuss48. “Not here, not there, not anywhere!” ― Dr. Seuss49. “Oh, the places you’ll go.” — Dr. Seuss50. “And will you succeed? Yes indeed, yes indeed! Ninety-eight and three-quarters percent guaranteed!” — Dr. Seuss51. \"Hollywood is not suited for me, and I am not suited for it.” — Dr. Seuss52. “My trouble was I had a mind but I couldn't make it up!” ― Dr. Seuss53. \"Just never forget to be dexterous and deft. And never mix up your right foot with your left.” ― Dr. Seuss54. “From there to here, and here to there, funny things are everywhere.” — Dr. Seuss55. “Take every chance, drop every fear.”― Dr. Seuss56. “It’s not about what it is. It’s about what it can become.” — Dr. Seuss57. “There are points to be scored. There are games to be won. And the magical things you can do with that ball will make you the winning-est winner of all.” — Dr. Seuss58. “It all began with a shoe on the wall. A shoe on the wall shouldn't be there at all.” ― Dr. Seuss59. “Just tell yourself, Duckie, you’re really quite lucky.” – Dr. Seuss60. “So, open your mouth, lad! For every voice counts!” — Dr. Seuss61. ““And this mess is so big and so deep and so tall, we cannot pick it up. There is no way at all!” ― Dr. Seuss62. “Unless someone like you cares a whole awful lot. Nothing is going to get better. It’s not.” — Dr. Seuss63. “Whenever things go a bit sour in a job I'm doing, I always tell myself, 'You can do better than this.’” — Dr. Seuss64. “Some people are much more… oh, ever so much more… oh, muchly much-much more unlucky than you!” ― Dr. Seuss65. “The storm starts, when the drops start dropping. When the drops stop dropping then the storm starts stopping.” ― Dr. Seuss66. “I'm sorry to say so but, sadly, it's true that bang-ups and hang-ups can happen to you.” ― Dr. Seuss67. “You’ll be on your way up! You’ll be seeing great sights! You’ll join the high fliers who soar to high heights.” — Dr. Seuss68. “I sort of got thinking—it’s sort of a shame that scrambled eggs always taste always the same.” — Dr. Seuss69. “Think and wonder. Wonder and think.” — Dr. Seuss70. \"Sometimes the questions are complicated and the answers are simple.” — Dr. Seuss71. Things may happen and often do to people as brainy and footsy as you.” – Dr. Seuss72. “Congratulations! Today is your day!” – Dr. Seuss73. “Poor empty pants with nobody inside them.” ― Dr. Seuss74. “I know it is wet and the sun is not sunny, but we can have lots of good fun that is funny.” — Dr. Seuss75. “You are you. Now, isn’t that pleasant?” – Dr. Seuss76. “I know, up on top you are seeing great sights, but down here at the bottom we, too, should have rights.” – Dr. Seuss77. “You’ll never be bored when you try something new. There’s really no limit to what you can do.” — Dr. Seuss78. “Cause when a guy does something stupid once, well that’s because he’s a guy. But if he does the same stupid thing twice, that’s usually to impress some girl.” ― Dr. SeussYou can see the Cat in the Hat take shape in this preliminary drawing circa 1958.79. “Being crazy isn't enough.” ― Dr. Seuss80. “Why fit in when you were born to stand out.” — Dr. Seuss81. “You ll be sort of surprised what there is to be found once you go beyond Z and start poking around ” ― Dr. Seuss82. “And the turtles, of course...all the turtles are free, as turtles and, maybe, all creatures should be.” ― Dr. Seuss83. “‘Tut tut!’ said the doctor. ‘Such talk! How absurd! Your tail is just right for your kind of bird.’” — Dr. Seuss84. “You can find magic wherever you look. Sit back and relax, all you need is a book.” – Dr. Seuss85. “When he worked, he really worked. But when he played, he really played.” — Dr. Seuss86. “I am the Lorax. I speak for the trees. I speak for the trees for the trees have no tongues.” ― Dr. Seuss87. “How did it get so late so soon? Its night before its afternoon. December is here before its June. My goodness how the time has flewn. How did it get so late so soon?” — Dr. Seuss88. “Why are they sad and glad and bad? I do not know, go ask your dad.” ― Dr. Seuss89. “Sometimes you will never know the value of a moment until it becomes a memory.” — Dr. Seuss90. “So be sure when you step, step with care and great tact. And remember that life is a great balancing act.” – Dr. Seuss91. “If things start happening, don’t worry, don’t stew, just go right along and you’ll start happening too.” — Dr. Seuss92. “He who makes a beast out of himself gets rid of the pain of being a man.” ― Dr. Seuss93. “All alone! Whether you like it or not, alone is something you’ll be quite a lot.” – Dr. Seuss94. “It is fun to have fun, but you have to know how.” – Dr. Seuss95. “You can get help from teachers, but you are going to have to learn a lot by yourself, sitting alone in a room.” — Dr. Seuss96. “Today I shall behave, as if this is the day I will be remembered.” — Dr. Seuss97. “Shorth is better than length.” ― Dr. Seuss98. “Nothing is going to change, unless someone does something soon.” — Dr. Seuss99. “So the writer who breeds more words than he needs, is making a chore for the reader who reads.” ― Dr. Seuss100. “You ought to be thankful, a whole heaping lot, for the places and people you’re lucky you’re not.” – Dr. Seuss101. “Everything stinks until it’s finished.” — Dr. Seuss102. “Oh, the things you can find if you don’t stay behind!” — Dr. Seuss103. “The more that you read, the more things you will know. The more that you learn, the more places you’ll go.”104.Want more great quotes? Check out…150Life Quotes50 Thinking of You Quotes150 Good Morning Quotes100 Wedding and Marriage Quotes50 Friday Quotes100 Quotes about Change101 Anxiety Quotes(Some images above are of Dr. Seuss’s planning sketches from a few of his beloved books. For more, check out Seussville.com.)"]}